docs/journal/2020-09-21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="clothoid" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b81bff">1. 2020-09-21</a>
<ul>
<li><a href="#orge5a1755">1.1. 06:41</a></li>
<li><a href="#org04a020c">1.2. 06:51</a></li>
<li><a href="#org9f74f99">1.3. 07:01</a></li>
<li><a href="#org12279d4">1.4. 07:35</a></li>
<li><a href="#org69b42b2">1.5. 14:46</a></li>
<li><a href="#org15ffeec">1.6. 14:47 leaf の config error</a></li>
<li><a href="#org5a6540a">1.7. 15:01 Warning (leaf): Error in `calendar' block.  Error msg: Symbol’s value as variable is void: calendar-iso-date-display-form</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1b81bff" class="outline-2">
<h2 id="org1b81bff"><span class="section-number-2">1.</span> 2020-09-21</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge5a1755" class="outline-3">
<h3 id="orge5a1755"><span class="section-number-3">1.1.</span> 06:41</h3>
<div class="outline-text-3" id="text-1-1">
<p>
M-x leaf-convert-insert-template ediff-wind で
</p>

<div class="org-src-container">
<pre class="src src-elisp">(leaf ediff-wind
  :doc "window manipulation utilities"
  :tag "builtin"
  :added "2020-09-21")   
</pre>
</div>

<p>
ってなるんだけど、これを編集して、
</p>

<div class="org-src-container">
<pre class="src src-elisp">(leaf ediff-wind
  :doc "window manipulation utilities"
  :tag "builtin"
  :added "2020-09-21"
  :custom ())
</pre>
</div>

<p>
とか書くと、:added とかいうの認識できないっぽいエラーとなって意味不明だけど、なんか直ったかも。
</p>
</div>
</div>

<div id="outline-container-org04a020c" class="outline-3">
<h3 id="org04a020c"><span class="section-number-3">1.2.</span> 06:51</h3>
<div class="outline-text-3" id="text-1-2">
<p>
これ。これがでる。:add があって、:config とか、:custom とかすると。leafで。
</p>

<pre class="example" id="org01ab34c">
Debugger entered--Lisp error: (error "leaf: Unrecognized keyword :added")
  signal(error ("leaf: Unrecognized keyword :added"))
  leaf-sort-values-plist((:doc nil :tag nil :added ("2020-09-21") :config nil :leaf-autoload nil :leaf-defer nil :leaf-protect nil :leaf-defun nil :leaf-defvar nil))
  #f(compiled-function (name &amp;rest args) "Symplify your `.emacs' configuration for package NAME with ARGS." #&lt;bytecode 0x12cbd61&gt;)(avoid :doc "make mouse pointer stay out of the way of editing" :tag "builtin" :added "2020-09-21" :config (mouse-avoidance-mode (quote banish)))
  macroexpand((leaf avoid :doc "make mouse pointer stay out of the way of editing" :tag "builtin" :added "2020-09-21" :config (mouse-avoidance-mode (quote banish))) nil)
  macroexp-macroexpand((leaf avoid :doc "make mouse pointer stay out of the way of editing" :tag "builtin" :added "2020-09-21" :config (mouse-avoidance-mode (quote banish))) nil)
  macroexp--expand-all((leaf avoid :doc "make mouse pointer stay out of the way of editing" :tag "builtin" :added "2020-09-21" :config (mouse-avoidance-mode (quote banish))))
  macroexpand-all((leaf avoid :doc "make mouse pointer stay out of the way of editing" :tag "builtin" :added "2020-09-21" :config (mouse-avoidance-mode (quote banish))))
  eval-sexp-add-defvars((leaf avoid :doc "make mouse pointer stay out of the way of editing" :tag "builtin" :added "2020-09-21" :config (mouse-avoidance-mode (quote banish))))
  elisp--eval-last-sexp(nil)
  eval-last-sexp(nil)
  funcall-interactively(eval-last-sexp nil)
  call-interactively(eval-last-sexp nil nil)
  command-execute(eval-last-sexp)
</pre>
</div>
</div>
<div id="outline-container-org9f74f99" class="outline-3">
<h3 id="org9f74f99"><span class="section-number-3">1.3.</span> 07:01</h3>
<div class="outline-text-3" id="text-1-3">
<p>
:emacs&lt;, :emacs&lt;=, :emacs=, :emacs&gt;, :emacs&gt;= keywords の使い方、全然分からない。
</p>
</div>
</div>
<div id="outline-container-org12279d4" class="outline-3">
<h3 id="org12279d4"><span class="section-number-3">1.4.</span> 07:35</h3>
<div class="outline-text-3" id="text-1-4">
<p>
わかった。:custom のあとには '() が必要で、 :config のあとには何もいらないのかな。
</p>
</div>
</div>
<div id="outline-container-org69b42b2" class="outline-3">
<h3 id="org69b42b2"><span class="section-number-3">1.5.</span> 14:46</h3>
</div>
<div id="outline-container-org15ffeec" class="outline-3">
<h3 id="org15ffeec"><span class="section-number-3">1.6.</span> 14:47 leaf の config error</h3>
<div class="outline-text-3" id="text-1-6">
<p>
leaf の :config に入れると以下のエラー
</p>
<pre class="example" id="orgaeb3e0b">
Warning (leaf): Error in `auto-install' block.  Error msg: Symbol’s function definition is void: auto-install-compatibility-setup
</pre>
</div>
</div>
<div id="outline-container-org5a6540a" class="outline-3">
<h3 id="org5a6540a"><span class="section-number-3">1.7.</span> 15:01 Warning (leaf): Error in `calendar' block.  Error msg: Symbol’s value as variable is void: calendar-iso-date-display-form</h3>
<div class="outline-text-3" id="text-1-7">
<p>
以下でも leaf だとエラー。
</p>

<div class="org-src-container">
<pre class="src src-elisp">;; 年月日をそろえて表示
(setq calendar-date-display-form calendar-iso-date-display-form)
(setq calendar-month-header calendar-iso-month-header)
(setq diary-date-forms diary-iso-date-forms)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
